PH_data/alpha_1.4/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
23940
(
( 1.983842412e-05 -6.901692359e-06 -2.838206683e-07 1.230006001e-05 -3.19410816e-07 1.621396223e-05 )
( 1.948688805e-05 -6.761541044e-06 -3.137302258e-07 1.196913399e-05 -3.140259821e-07 1.608223829e-05 )
( 1.896582398e-05 -5.955453616e-06 -1.941178738e-07 1.118618729e-05 -3.020686847e-07 1.665393029e-05 )
( 1.913204869e-05 -6.617137842e-06 -3.367474619e-07 1.164688911e-05 -3.06421498e-07 1.599718235e-05 )
( 1.866369712e-05 -5.819096714e-06 -2.051009744e-07 1.083359348e-05 -2.943623656e-07 1.655637789e-05 )
( 1.843353311e-05 -4.982821338e-06 -9.385216515e-08 9.872028386e-06 -2.454133323e-07 1.712948142e-05 )
( 1.876777969e-05 -6.466573268e-06 -3.521506926e-07 1.132751004e-05 -2.963945462e-07 1.596409857e-05 )
( 1.836472075e-05 -5.677019544e-06 -2.094499791e-07 1.048507966e-05 -2.881361638e-07 1.651735511e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
